app/views/trips/show.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    <p class='comment'><%=comment.content%></p>
    <p class='comment_author'>@<%=User.find(comment.user_id).username%></p>