app/controllers/authentications_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "donboy987"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(username: params[:authentication][:username])