app/controllers/feed_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 5]]
SELECT  "trips".* FROM "trips" ORDER BY "trips"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def feed
    @posts = Post.last(5)
    @trips = Trip.last(5)