app/controllers/posts_controller.rb

  def index
    @posts = Post.all.reverse
---
SELECT "posts".* FROM "posts"

  def show
    @post = Post.find(params[:id])
    @user = User.find(session[:user_id])
    @follow = @post.user
    @event_user_id = @follow.id
    @comment = Comment.new(commentable: @post)
    @comments = Comment.post_comments.select {|comment| comment.commentable_id == params[:id].to_i}
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]
      if @post.save
---
INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
      @post = Post.find(params[:id])
      @post.update(title: post_params['title'], description: post_params['description'])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "I really hate woods a lot #merblyfe"], ["updated_at", "2019-04-19 19:03:07.746573"], ["id", 6]]