app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = $1  [["follower_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = $1  [["follower_id", 2]]
---
  def index
    @user = User.find(params[:id])
    @following_relationships = @user.active_relationships
    @follower_relationships = @user.passive_relationships
    @followingcount = @following_relationships.count
    @followercount = @follower_relationships.count
    @followingobjects = @following_relationships.map do |ar|
      User.find(ar.followed_id)
    end
    @followerobjects = @follower_relationships.map do |pr|
      User.find(pr.follower_id)

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 8], ["followed_id", 3], ["created_at", "2019-04-19 21:53:05.132360"], ["updated_at", "2019-04-19 21:53:05.132360"]]
---
  def create
    Relationship.create(follower_id: params[:follower_id], followed_id: params[:followed_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "relationships".* FROM "relationships"
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 64]]
---
  def destroy
    @user = User.find(session[:user_id])
    @followed_id = get_id(params)
    @relation = Relationship.find do |r| r.follower_id == @user.id && r.followed_id == @followed_id
    end
    @relation.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_id(params)
    if params[:page_type] == 'users'
      User.find(params[:id]).id
    elsif params[:page_type] == 'trips'
      Trip.find(params[:id]).user_id
    else
      Post.find(params[:id]).user_id