app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = $1  [["follower_id", 4]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = $1  [["follower_id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" DESC LIMIT $2  [["user_id", 8], ["LIMIT", 5]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" DESC LIMIT $2  [["user_id", 4], ["LIMIT", 5]]
SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = $1 ORDER BY "trips"."id" DESC LIMIT $2  [["user_id", 8], ["LIMIT", 5]]
---
  def show
    @user = User.find(session[:user_id])
    @follow = User.find(params[:id])
    @event_user_id = @follow.id
    @following_relationships = @follow.active_relationships
    @follower_relationships = @follow.passive_relationships

    current_user = User.find(params[:id])

    @followingcount = @following_relationships.count
    @followercount = @follower_relationships.count

    @followingobjects = @following_relationships.map do |ar|
      User.find(ar.followed_id)
    end

    @followerobjects = @follower_relationships.map do |pr|
      User.find(pr.follower_id)
    end

    @posts = @follow.posts.last(5)
    @trips = @follow.trips.last(5)

INSERT INTO "users" ("first_name", "last_name", "username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save