app/models/comment.rb

SELECT "comments".* FROM "comments"
---
  def self.post_comments
    self.all.select {|comment| comment.commentable_type == "Post"}

SELECT "comments".* FROM "comments"
---
  def self.trip_comments
    self.all.select {|comment| comment.commentable_type == "Trip"}